---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StructGroupMemberWillDetachFromGrid
source: html/948de625-d0cd-c614-1d2d-d681d8b33817.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StructGroupMemberWillDetachFromGrid Property

A structural element will be detached from grid(s) due to inconsistent group membership.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructGroupMemberWillDetachFromGrid { get; }
```